XMLconfiguration/Documents/ПФР_Налоговая_СоцВыплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПФР_Налоговая_СоцВыплаты</Name>
			<BasedOn>
				<xr:Item>Catalog.Обучающиеся</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриказОЗачислении</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДвижениеОбучающихся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассЗачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассныйРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

XMLconfiguration/Catalogs/УчебныеГода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>УчебныеГода</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КлассноеРуководство</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Классы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассныйРуководитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

XMLconfiguration/Documents/ПФР_Налоговая_СоцВыплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ЗагрузитьАктуальныйПриказ(Ссылка)
	Отбор = Новый Структура("Обучающийся", Ссылка);
	Срез = РегистрыСведений.ДвиженияОбучающихся.СрезПоследних(Объект.Дата,Отбор);
	Если Срез.Количество() < 1 Тогда  // Если не найдено данных		
		Возврат Ложь;
	Иначе
		 АктуальныйПриказ = Срез[0].Регистратор;
		 Объект.Класс = Срез[0].Класс;   
		 ЗапросУчебныйГод = Новый Запрос("ВЫБРАТЬ
		                                 |	УчебныеГодаКлассноеРуководство.Класс КАК Класс,
		                                 |	УчебныеГодаКлассноеРуководство.КлассныйРуководитель КАК КлассныйРуководитель
		                                 |ИЗ
		                                 |	Справочник.УчебныеГода.КлассноеРуководство КАК УчебныеГодаКлассноеРуководство
		                                 |ГДЕ
		                                 |	УчебныеГодаКлассноеРуководство.Класс = &Класс
		                                 |	И УчебныеГодаКлассноеРуководство.Ссылка = &УчебныйГод");
		 ЗапросУчебныйГод.УстановитьПараметр("Класс",Объект.Класс);
		 ЗапросУчебныйГод.УстановитьПараметр("УчебныйГод",Срез[0].УчебныйГод);
		 Выборка = ЗапросУчебныйГод.Выполнить().Выбрать();
		 Если Выборка.Следующий() Тогда
			Объект.КлассныйРуководитель = Выборка.КлассныйРуководитель;	 
		Иначе
			Объект.КлассныйРуководитель = Справочники.Сотрудники.ПустаяСсылка();		
		 КонецЕсли;
		 Возврат Истина;
	КонецЕсли
КонецФункции

&НаСервере
Функция ЗагрузитьПриказОЗачислении(Ссылка)
	Отбор = Новый Структура("Обучающийся", Ссылка);
	Отбор.Вставить("ТипДвижения",Перечисления.ТипыДвиженияОбучающегося.ПриемНаОбучение);
	ЗапросПриказ = Новый Запрос("ВЫБРАТЬ
	                            |	ДвиженияОбучающихся.Регистратор КАК Регистратор,
								|	ДвиженияОбучающихся.Класс КАК Класс
	                            |ИЗ
	                            |	РегистрСведений.ДвиженияОбучающихся КАК ДвиженияОбучающихся
	                            |ГДЕ
	                            |	ДвиженияОбучающихся.Обучающийся = &Обучающийся
	                            |	И ДвиженияОбучающихся.ТипДвижения = &ТипДвижения
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	ДвиженияОбучающихся.Период УБЫВ");
	ЗапросПриказ.Параметры.Вставить("Обучающийся", Ссылка);
	ЗапросПриказ.Параметры.Вставить("ТипДвижения", Перечисления.ТипыДвиженияОбучающегося.ПриемНаОбучение);
	Приказы = ЗапросПриказ.Выполнить().Выбрать();
	Если Приказы.Количество() < 1 Тогда  // Если не найдено данных		
		Возврат Ложь;
	Иначе                                      
		 Приказы.Следующий();
		 Объект.ПриказОЗачислении = Приказы.Регистратор;
		 Объект.КлассЗачисления = Приказы.Класс;
		 Возврат Истина;
	КонецЕсли
КонецФункции

&НаСервере
Функция ЗаполнитьДанные(Ссылка)
	Ответ1 = ЗагрузитьАктуальныйПриказ(Ссылка);
	Ответ2 = ЗагрузитьПриказОЗачислении(Ссылка);
	Если Ответ1 И Ответ2 Тогда
		РассчитатьОкончаниеУчебы();		
	Иначе
		Объект.ДатаОкончанияОбучения = Дата(Год(ТекущаяДата()),06,30);	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбучающийсяПриИзменении(Элемент)
	Ответ = ЗаполнитьДанные(Объект.Обучающийся);
КонецПроцедуры

&НаСервере
Функция РассчитатьОкончаниеУчебы()
	// Первый календарный год учебного года (если уч. год 2020-2021 - будет 2020)
	ЗачислениеГод = Год(Объект.ПриказОЗачислении.УчебныйГод.Начало);
	ЗачислениеКласс = Число(СтрРазделить(Объект.КлассЗачисления.Наименование," ",Ложь)[0]);
	НужноУчитьсяЛет = Неопределено;
    Если ЗачислениеКласс <= 9 Тогда
		НужноУчитьсяЛет = 10 - ЗачислениеКласс;
	Иначе
		НужноУчитьсяЛет = 12 - ЗачислениеКласс;
	КонецЕсли;	
	Объект.ДатаОкончанияОбучения = Дата(ЗачислениеГод+НужноУчитьсяЛет,06,30);
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ответ = ЗаполнитьДанные(Объект.Обучающийся);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Ответ = ЗаполнитьДанные(Объект.Обучающийся);
КонецПроцедуры
